hunt/baseCase/basecase_mhdEpotMultiRegionFoam_Ha20_strongScaling_80k_20k_spr/0/fluid/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (0 0 20);

boundaryField
{
    topWall
   {
        type            zeroGradient;
    }
    botWall
  {
        type            zeroGradient;
    }
    frontWall
  {
        type            zeroGradient;
    }
    backWall
  {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }      
}

// ************************************************************************* //
